# Project 1: Fuctional Requierments Interface

   ## Set up

#### First set up the Database in mysql by making a schema named pluto_realty. Then run the provided sql scripts to build and populate the database. then run the cell below to connect to it.

In [31]:
#!pip install ipython-sql
%alias_magic skipcell script "-p --no-raise-error false" --cell  
%pylab inline

%load_ext sql
%config SqlMagic
from collections import OrderedDict
import re
import copy
import urllib.request
!pip install mysql-connector-python

import getpass
if True:
    db_user = getpass.getpass('Enter username')
    db_password = getpass.getpass('Enter password')
    connection_url = f'mysql+mysqlconnector://{db_user}:{db_password}@localhost/pluto_realty'
        
%sql {connection_url}

Created `%%skipcell` as an alias for `%%script  --no-raise-error false`.
Populating the interactive namespace from numpy and matplotlib
The sql extension is already loaded. To reload it, use:
  %reload_ext sql
SqlMagic options
--------------
SqlMagic.autocommit=<Bool>
    Current: True
    Set autocommit mode
SqlMagic.autolimit=<Int>
    Current: 0
    Automatically limit the size of the returned result sets
SqlMagic.autopandas=<Bool>
    Current: False
    Return Pandas DataFrames instead of regular result sets
SqlMagic.column_local_vars=<Bool>
    Current: False
    Return data into local variables from column names
SqlMagic.displaycon=<Bool>
    Current: True
    Show connection string after execute
SqlMagic.displaylimit=<Int>
    Current: None
    Automatically limit the number of rows displayed (full result set is still
    stored)
SqlMagic.dsn_filename=<Unicode>
    Current: 'odbc.ini'
    Path to DSN file. When the first argument is of the form [section], a
    sqlalchemy connection string is formed from the matching section in the DSN
    file.
SqlMagic.feedback=<Bool>
    Current: True
    Print number of rows affected by DML
SqlMagic.short_errors=<Bool>
    Current: True
    Don't display the full traceback on SQL Programming Error
SqlMagic.style=<Unicode>
    Current: 'DEFAULT'
    Set the table printing style to any of prettytable's defined styles
    (currently DEFAULT, MSWORD_FRIENDLY, PLAIN_COLUMNS, RANDOM)

C:\Users\benth\Anaconda3\lib\site-packages\IPython\core\magics\pylab.py:160: UserWarning: pylab import has clobbered these variables: ['copy']
`%matplotlib` prevents importing * from pylab and numpy
  "\n`%matplotlib` prevents importing * from pylab and numpy"

Requirement already satisfied: mysql-connector-python in c:\users\benth\anaconda3\lib\site-packages (8.0.21)
Requirement already satisfied: protobuf>=3.0.0 in c:\users\benth\anaconda3\lib\site-packages (from mysql-connector-python) (3.13.0)
Requirement already satisfied: six>=1.9 in c:\users\benth\anaconda3\lib\site-packages (from protobuf>=3.0.0->mysql-connector-python) (1.12.0)
Requirement already satisfied: setuptools in c:\users\benth\anaconda3\lib\site-packages (from protobuf>=3.0.0->mysql-connector-python) (41.4.0)
Enter username········
Enter password········

# 1. List the names of all the unique clients.

#### Sample Querys:

In [2]:
%%sql
SELECT first_name, last_name 
from person INNER JOIN business_client
WHERE person.ID = business_client.ID;

 * mysql+mysqlconnector://root:***@localhost/pluto_realty
11 rows affected.

[('Sponge', 'Bob'),
 ('Patrick', 'Star'),
 ('Squid', 'Ward'),
 ('Sandy', 'Cheeks'),
 ('Gromit', 'Smith'),
 ('Billy', 'Doe'),
 ('Amilea', 'Wattson'),
 ('Gura', 'Gawr'),
 ('Takanashi', 'Kiara'),
 ('Subaru', 'Ozaru'),
 ('Haachama', 'Chama')]

# 2. Find the unique names of owners and total square footage of all the properties they own.

<div>
USes a Common Table Expressions to return a table of sq_ft for each owner by their ids. then inner joins that table with person to append their names.
</div>

#### Sample Querys:

In [3]:
%%sql
WITH sq_ft_by_owner_id(owner_id, total_area_sq_ft) AS
(SELECT owner_id, SUM(area_sq_ft)
FROM rental_property
GROUP BY owner_id)

SELECT first_name, last_name, owner_id, total_area_sq_ft
from person INNER JOIN sq_ft_by_owner_id
WHERE person.ID = sq_ft_by_owner_id.owner_id;

 * mysql+mysqlconnector://root:***@localhost/pluto_realty
6 rows affected.

[('Matsuri', 'Channel', 19, Decimal('324')),
 ('Sora', 'Channel', 21, Decimal('1500')),
 ('Ayame', 'Nakiri', 22, Decimal('2800')),
 ('Aqua', 'Channel', 23, Decimal('1300')),
 ('Last', 'Airbender', 24, Decimal('700')),
 ('Pat', 'Doe', 26, Decimal('1800'))]

# 3. Find the properties shown by each associate in a given month.

<div>
@given_month is a variable that will hold the value for the given month obtained from user input.
</div>

#### Sample Querys:

Run this code cell first. then the one below it

In [29]:
#Gets user input for month
input_value = input("Enter a integer reresentation of a month to view propertie viewings durring that month: ");

try:
    val = int(input_value)
except ValueError:
    print("Input must be a integer!!!")

Enter a integer reresentation of a month to view propertie viewings durring that month: 3

In [30]:
%%sql 
SET @given_month = {input_value};
SELECT associate_id, (SELECT CONCAT(first_name, " ", last_name) FROM person WHERE person.ID = property_viewing.associate_id) AS name, property_num, viewing_date
FROM property_viewing
WHERE MONTH(viewing_date) = @given_month
ORDER BY associate_id;

 * mysql+mysqlconnector://root:***@localhost/pluto_realty
0 rows affected.
1 rows affected.

[(2, 'John Smith', 1006, datetime.date(2019, 3, 20))]

# 4. Find the most popular properties (in terms of number of viewings in a given year).

@given_year variable would be the value obtained from user input.

#### Sample Querys:

Run this code cell first. then the one below it

In [ ]:
#Gets user input for year
input_value = input("Enter a integer reresentation of a year to Find the most popular properties in the year: ");

try:
    val = int(input_value)
except ValueError:
    print("Input must be a integer!!!")

In [ ]:
%%sql
SET @given_year = {input_value};
SELECT property_num, COUNT(property_num) as num_of_viewings
FROM property_viewing
WHERE YEAR(viewing_date) = @given_year
GROUP BY property_num
ORDER BY num_of_viewings DESC;

# 5. Find the total rent due to each property owner

#### Sample Querys:

In [ ]:
%%sql
SELECT owner_id, (SELECT CONCAT(first_name, " ", last_name) FROM person WHERE person.ID = rental_property.owner_id) AS owner_name, SUM(lease.monthly_rent) AS total_rent_owed
FROM lease INNER JOIN rental_property
WHERE rental_property.property_num = lease.property_num
GROUP BY owner_id;

#  6. Find the unique names of associates supervised (directly or indirectly) by a given employee.

@given_employee variable would be the value obtained from user input

 #### Sample Querys:

In [69]:
#Gets user input for given employee
input_value = input("Enter the ID of a employee to which associates are supervised by said employee: ");

try:
    val = int(input_value)
except ValueError:
    print("Input must be a integer!!!")

Enter the ID of a employee to which associates are supervised by said employee: 0

In [46]:
%%sql
-- #Finds associates directly supervised by a given employee
SET @employee_ID = {input_value};

WITH associate_list(ID, first_name, last_name, manager_id) AS
(
SELECT associate.ID, first_name, last_name, manager_id
FROM associate INNER JOIN employee INNER JOIN person 
WHERE associate.ID = employee.ID AND associate.ID = person.ID  
)


SELECT ID, first_name, last_name
FROM associate_list
WHERE manager_id = @employee_ID;

 * mysql+mysqlconnector://root:***@localhost/pluto_realty
0 rows affected.
2 rows affected.

[(3, 'jane', 'dowe'), (4, 'Bob', 'Builder')]

In [104]:
%%sql
-- #Finds associates directly and indirectly supervised by a given employee
SET @employee_ID = {input_value};


WITH recursive_list(ID, manager_id) AS
(
    SELECT ID, manager_id
    FROM employee
    WHERE manager_id = @employee_ID
    
    UNION ALL
    
    SELECT a.ID, a.manager_id
    FROM employee AS a, recursive_list AS o
    WHERE o.ID = a.manager_id
)
SELECT * 
FROM associate INNER JOIN recursive_list
WHERE associate.ID = recursive_list.ID;

 * mysql+mysqlconnector://root:***@localhost/pluto_realty
(mysql.connector.errors.ProgrammingError) 1146 (42S02): Table 'pluto_realty.recursive_list' doesn't exist
[SQL: -- #Finds associates directly and indirectly supervised by a given employee
WITH recursive_list(ID, manager_id) AS
(
    SELECT ID, manager_id
    FROM employee
    WHERE manager_id IS NULL

    UNION ALL

    SELECT a.ID, a.manager_id
    FROM employee AS a, recursive_list AS o
    WHERE o.ID = a.manager_id
)
SELECT *
FROM associate INNER JOIN recursive_list
WHERE associate.ID = recursive_list.ID;]
(Background on this error at: http://sqlalche.me/e/f405)

# 7. Find the unique names of owners that have a residential property in every city where Pat Doe owns a commercial property

#### Sample Querys:

In [37]:
%%sql
WITH pat_doe_id(ID) AS
(
SELECT ID FROM person WHERE person.first_name = 'Pat' AND person.last_name =  'Doe'
),
citys_with_pat_doe(owner_id ,city) AS
(
SELECT owner_id, city
FROM commercial INNER JOIN rental_property
WHERE rental_property.owner_id IN (SELECT ID FROM pat_doe_id)
),
owners_in_same_city(id) AS
(
SELECT owner_id
FROM residential INNER JOIN rental_property
WHERE residential.property_num = rental_property.property_num 
AND city IN (SELECT distinct(city) FROM citys_with_pat_doe)
        GROUP BY rental_property.owner_id
        HAVING COUNT(DISTINCT city) = (SELECT COUNT(distinct(city)) AS num_city FROM citys_with_pat_doe)
)

SELECT first_name, last_name
FROM person INNER JOIN owners_in_same_city
WHERE owners_in_same_city.id = person.id;

 * mysql+mysqlconnector://root:***@localhost/pluto_realty
2 rows affected.

[('Matsuri', 'Channel'), ('Robco', 'Channel')]

# 8. Find the top-3 partners with respect to number of properties leased in the current year.

#### Sample Querys:

In [35]:
%%sql
SET @date = current_date();

SELECT partner_id, COUNT(lease_num) AS number_of_leases_this_year 
FROM lease
WHERE YEAR(lease_date) = YEAR(@date)
GROUP BY partner_id 
ORDER BY number_of_leases_this_year DESC
LIMIT 3;

 * mysql+mysqlconnector://root:***@localhost/pluto_realty
0 rows affected.
2 rows affected.

[(5, 2), (6, 1)]

# 9. Write a SQL function to compute the total management fees due to Pluto in the last 3 months.

#### Sample Querys:

In [36]:
%%sql
WITH management_fees(property_num, management_fee, start_date, end_date) AS
(SELECT lease.property_num, (lease.monthly_rent*rental_property.management_fee_percentage) AS management_fee, start_date, end_date
FROM lease INNER JOIN rental_property
WHERE lease.property_num = rental_property.property_num)

SELECT SUM(management_fee*3) AS Total_Management_fee_for_past_3_months
FROM management_fees
WHERE current_date() >= management_fees.start_date AND
	  current_date() <= management_fees.end_date;

 * mysql+mysqlconnector://root:***@localhost/pluto_realty
1 rows affected.

[(102.0,)]

# 10. Creates a SQL trigger to automatically set to FALSE the advertisement flag of a property when it is leased.

Trigger is implemented in the create all sql file.